t1(том-ям,1).
t1(харчо,1).
t1(борщ,1).
t1(окрошка,1).
t1(лазанья,2).
t1(гуляш,2).
t1(драники,2).
t1(паста_с_морепродуктами,2).
t1(греческий_салат,2).
t1(холодец,2).
t1(оливье,2).
t1(плов,2).
t1(эклеры,3).
t1(желе_с_фруктами,3).
t1(запеканка,3).
t1(фондан,3).
t1(штрудель,3).
t1(пирожки_со_сгущенкой,3).

t2(том-ям,1).
t2(харчо,1).
t2(борщ,1).
t2(окрошка,1).
t2(лазанья,2).
t2(гуляш,3).
t2(драники,2).
t2(паста_с_морепродуктами,2).
t2(греческий_салат,2).
t2(холодец,2).
t2(оливье,2).
t2(плов,2).
t2(эклеры,3).
t2(желе_с_фруктами,3).
t2(запеканка,2).
t2(фондан,2).
t2(штрудель,2).
t2(пирожки_со_сгущенкой,3).

t3(том-ям,4).
t3(харчо,4).
t3(борщ,2).
t3(окрошка,2).
t3(лазанья,1).
t3(гуляш,2).
t3(драники,2).
t3(паста_с_морепродуктами,1).
t3(греческий_салат,4).
t3(холодец,2).
t3(оливье,2).
t3(плов,4).
t3(эклеры,3).
t3(желе_с_фруктами,4).
t3(запеканка,2).
t3(фондан,4).
t3(штрудель,4).
t3(пирожки_со_сгущенкой,2).

t4(том-ям,0).
t4(харчо,1).
t4(борщ,1).
t4(окрошка,1).
t4(лазанья,1).
t4(гуляш,1).
t4(драники,1).
t4(паста_с_морепродуктами,0).
t4(греческий_салат,1).
t4(холодец,1).
t4(оливье,1).
t4(плов,1).
t4(эклеры,1).
t4(желе_с_фруктами,1).
t4(запеканка,1).
t4(фондан,1).
t4(штрудель,1).
t4(пирожки_со_сгущенкой,1).

t5(том-ям,1).
t5(харчо,1).
t5(борщ,1).
t5(окрошка,0).
t5(лазанья,0).
t5(гуляш,1).
t5(драники,1).
t5(паста_с_морепродуктами,0).
t5(греческий_салат,0).
t5(холодец,1).
t5(оливье,1).
t5(плов,1).
t5(эклеры,0).
t5(желе_с_фруктами,1).
t5(запеканка,0).
t5(фондан,1).
t5(штрудель,0).
t5(пирожки_со_сгущенкой,0).

t6(том-ям,1).
t6(харчо,1).
t6(борщ,1).
t6(окрошка,1).
t6(лазанья,1).
t6(гуляш,1).
t6(драники,1).
t6(паста_с_морепродуктами,1).
t6(греческий_салат,1).
t6(холодец,1).
t6(оливье,1).
t6(плов,1).
t6(эклеры,1).
t6(желе_с_фруктами,0).
t6(запеканка,0).
t6(фондан,1).
t6(штрудель,0).
t6(пирожки_со_сгущенкой,1).

t7(том-ям,1).
t7(харчо,1).
t7(борщ,1).
t7(окрошка,4).
t7(лазанья,3).
t7(гуляш,2).
t7(драники,2).
t7(паста_с_морепродуктами,1).
t7(греческий_салат,4).
t7(холодец,1).
t7(оливье,4).
t7(плов,1).
t7(эклеры,3).
t7(желе_с_фруктами,4).
t7(запеканка,3).
t7(фондан,3).
t7(штрудель,3).
t7(пирожки_со_сгущенкой,3).

t8(том-ям,1).
t8(харчо,1).
t8(борщ,1).
t8(окрошка,0).
t8(лазанья,1).
t8(гуляш,1).
t8(драники,1).
t8(паста_с_морепродуктами,1).
t8(греческий_салат,0).
t8(холодец,0).
t8(оливье,0).
t8(плов,1).
t8(эклеры,0).
t8(желе_с_фруктами,0).
t8(запеканка,1).
t8(фондан,1).
t8(штрудель,1).
t8(пирожки_со_сгущенкой,1).

t9(том-ям,1).
t9(харчо,1).
t9(борщ,1).
t9(окрошка,1).
t9(лазанья,1).
t9(гуляш,1).
t9(драники,1).
t9(паста_с_морепродуктами,1).
t9(греческий_салат,1).
t9(холодец,1).
t9(оливье,1).
t9(плов,1).
t9(эклеры,1).
t9(желе_с_фруктами,1).
t9(запеканка,1).
t9(фондан,0).
t9(штрудель,0).
t9(пирожки_со_сгущенкой,1).

t10(том-ям,0).
t10(харчо,0).
t10(борщ,0).
t10(окрошка,0).
t10(лазанья,0).
t10(гуляш,1).
t10(драники,0).
t10(паста_с_морепродуктами,1).
t10(греческий_салат,0).
t10(холодец,1).
t10(оливье,0).
t10(плов,0).
t10(эклеры,1).
t10(желе_с_фруктами,1).
t10(запеканка,1).
t10(фондан,1).
t10(штрудель,1).
t10(пирожки_со_сгущенкой,1).


q1(X1):-write("Вид блюда"), nl, write("1-первое"), nl, write("2-второе"), nl, write("3-десерт"),nl, read(X1).
q2(X2):-write("Вид подачи"), nl, write("1-в глубокой миске"), nl, write("2-в плоской тарелке"), nl,write("3-в горшочке/креманке/не имеет значения"),nl, read(X2).
q3(X3):-write("Это блюдо какой кухни?"), nl, write("1-Итальянская"), nl, write("2-Русской"),nl, write("3-Французкой"),nl, write("4-Другой"), nl, read(X3).
q4(X4):-write("Содержит ли оно морепродукты?"), nl, write("0-да"), nl, write("1-нет"), nl, read(X4).
q5(X5):-write("Содержит ли оно молочные продукты?"), nl, write("0-да"), nl, write("1-нет"), nl, read(X5).
q6(X6):-write("Содержит ли оно фрукты?"), nl, write("0-да"), nl, write("1-нет"), nl, read(X6).
q7(X7):-write("Это блюдо"),nl, write("1-Вареное"), nl, write("2-Жареное"),nl, write("3-Запеченное"),nl, write("4-Что-то другое"), nl, read(X7).
q8(X8):-write("Его подают холодным?"), nl, write("0-да"), nl, write("1-нет"), nl,read(X8).
q9(X9):-write("Его подают с мороженным?"), nl, write("0-да"), nl, write("1-нет"), nl, read(X9).
q10(X10):-write("Содержит ли оно овощи?"), nl, write("0-да"), nl, write("1-нет"), nl, read(X10).

rez:-q1(X1),q2(X2),q3(X3),q4(X4),q5(X5),q6(X6),q7(X7),q8(X8),q9(X9),q10(X10),t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6),t7(X,X7),t8(X,X8),t9(X,X9),t10(X,X10),write(X).

rez1:-q1(X1),((findall(X,t1(X,X1),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q2(X2),((findall(X,(t1(X,X1),t2(X,X2)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q3(X3),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q4(X4),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q5(X5),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5)),L),t6(L,N),N==1,nl,write(L),nl,abort());true),
    q6(X6),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q7(X7),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6),t7(X,X7)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q8(X8),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6),t7(X,X7),t8(X,X8)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q9(X9),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6),t7(X,X7),t8n(X,X8),t9(X,X9)),L),length(L,N),N==1,nl,write(L),nl,abort());true),
    q10(X10),((findall(X,(t1(X,X1),t2(X,X2),t3(X,X3),t4(X,X4),t5(X,X5),t6(X,X6),t7(X,X7),t8(X,X8),t9(X,X9),t10(X,X10)),L),length(L,N),N==1,nl,write(L),nl,abort());true).
